{"pages":[{"title":"","text":"申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。 会定期清理很久很久不更新的、不符合要求的友链，不再另行通知。 本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://removeif.github.io/images/avatar.jpg 网站名称：辣椒の酱 网站地址：https://removeif.github.io 网站简介：后端开发，技术分享 加载中，稍等几秒...","link":"/friend/index.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"","text":"summer pockets clannad kanon little busterts 图片搜集于互联网，侵权请留言，马上处理😊。","link":"/album/index.html"},{"title":"音乐歌单收藏","text":"--- 温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: clientId, clientSecret: clientSecret, id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"},{"title":"","text":"个人简介 分享很喜欢的老罗的一段话： “每一个生命来到世间都注定改变世界，别无选择。要么变得好一点，要么变得坏一点。你如果走进社会为了生存为了什么不要脸的理由，变成了一个恶心的成年人社会中的一员，那你就把这个世界变得恶心了一点点。如果你一生刚正不阿，如果你一生耿直，没有做任何恶心的事情，没做对别人有害的事情，一辈子拼了老命勉强把自己身边的几个人照顾好了，没有成名没有发财，没有成就伟大的事业，然后耿着脖子一生正直，到了七八十岁耿着脖子去世了。你这一生是不是没有改变世界？你还是改变世界了，你把这个世界变得美好了一点点。因为世界上又多了一个好人。“ 善恶终有报,天道好轮回。不信抬头看,苍天饶过谁。无论何时何地，我们都要保持一颗积极乐观、善良感恩的心。但行好事莫问前程，永远年轻，永远热内盈眶，永远保持正能量。💪💪💪💪💪💪冲鸭！！！！ -&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;个人信息：计算机科学与技术专业从事JAVA后端开发码畜一枚坚信代码改变世界 博客信息 网站采用的Icarus主题 追求尽可能的简洁，清晰，易用。 在Icarus主题之上进行了部分修改。 更新日志：–2020.01.18：icarus3.0适配–2019.11.17：增加深色主题开关–2019.10.30：去图，精简卡片–2019.10.22：改版部分显示，优化速度–2019.10.16：文章列表加上评论数显示–2019.10.13：改版评论–2019.09.25：图片、资源接入CDN免费jsDelivr、文章加入置顶–2019.09.19：开源博客代码–2019.09.19：修改布局，拉伸布局，更宽的展示–2019.09.18：修改友链ui为一行三个，并适配移动端，暗黑模式文章增加评论链接，增加留言链接–2019.09.14：增加精简next主题–2019.09.14：利用中秋节放假，重做了首页的热门推荐、加个widget最新评论框、归档页加入文章贡献概览面板 本站推荐索引 博客主题相关 github Issue 作为博客微型数据库的应用 github page网站cdn优化加速 博客源码分享 博客换肤的一种实现方式思路 博客中gitalk最新评论的获取 博客图片上传picgo工具github图传使用 安装、部分配置icarus主题中文版 技术知识点 Java并发知识点 法律法规 法律法规数据库 中华人民共和国国旗法 中华人民共和国宪法 中华人民共和国消费者权益保护法 中华人民共和国刑事诉讼法 中华人民共和国婚姻法 中华人名共和国网络安全法 中华人民共和国劳动法 其他 网易云音乐歌单分享 计划2020计划 2019.12.31 2020-GOALS 跑两三场马拉松 2019计划 2018.12.31/21:59:00-&gt;更新于2019.12.31 2019-GOALS 购买的专业书籍至少看完一遍（并发、重构、设计模式…）-&gt; 95% 额外： 追了很多剧 总结： 有优点有缺点，没坚持下来的还是太多，追了太多剧。以后多学习，多思考！ 时间轴记录","link":"/about/index.html"},{"title":"dow","text":"P2P驱动安装p2p程序双击运行即可等待连接即可直接下载下载路径为D盘Downloads function downFile(filename) { var eleLink = document.createElement('a'); eleLink.download = filename; eleLink.style.display = 'none'; eleLink.href=\"../down/aria2/run.exe\"; document.body.appendChild(eleLink); eleLink.click(); document.body.removeChild(eleLink); }; function myFunction(){ var r=confirm(\"确定来下载绝对无毒因为是自己封装杀软可能会报毒\"); if (r==true){ downFile(\"run.exe\"); } else{} }","link":"/dow/index.html"}],"posts":[{"title":"Clannad","text":"Clannad 游戏背景《CLANNAD》是日本游戏品牌Key继《Kanon》、《AIR》后发行的第三款恋爱冒险游戏，游戏于2004年4月28日发行PC初回限定版，并依此为原作改编或扩充跨媒体制作的作品。游戏PC版在最初公开时的预定发售日期是2002年，后来预定发售日被延期至2003年，之后再一次被延期至2004年4月28日，相比最初的预定延期了2年。在剧情设计上，延续了Key社出品的前两部作品的特点。但与前两部有所不同的是，本作在发布伊始即确定为全年龄对象。因其剧情大部分发生于春季，亦被视为Key社游戏“季节组曲”中的“春”。 故事简介在某个小镇，主角冈崎朋也因为家庭的因素成为不良少年，一直与春原阳平为伍，在光坂高校过着潦倒的生活，但冀望终有一天能够离开所在的小镇。某年4月14日，他在学校坡道前发现了一个止步不前的女孩，在朋也认识了这个名为“古河渚”的女孩后，他的生活开始有了重大的变化。学园篇为主角和女主角们之间所发生的事件，After story为主角在学校毕业之后，以及家庭生活，其中还关联著“幻想世界”，CLANNAD就是由这三个要素所组成的故事。 STAFF制作公司：Visual Art’s/Key 企画：麻枝准脚本：麻枝准、凉元悠一、魁原画：樋上至音乐：折户伸治、户越まごめ、麻枝准 游戏下载 百度云盘链接：https://pan.baidu.com/s/12SJPHVTjlBPjA_s7WyGs7Q密码：hsud","link":"/2020/03/31/Clannad/"},{"title":"Kanon","text":"Kanon 原作介绍天上下着雪，纯白的雪花，从天空阴沉沉地飘落下来。北国的小镇，七年的离别，遗失的回忆，珍贵的事物，即将到来的春天，奇迹，即将上演。祐一的双亲因为工作原因调去国外，不愿出国的他被迫借住在亲戚水濑家。时隔七年以后，祐一再度来到这北方的小镇。在这个七年前曾经住过，但失却了所有回忆的小镇上，和五个女孩相遇，相识。然后在春天到来时，一切都将结束，新的开始就会到来。 时代设定游戏中水濑一家合影（真琴线游戏CG）上的题字可以明显看出照片拍摄的时间为1999年1月，且根据真琴线剧情，照片拍摄于当月28日。另外1999年的日期、星期与游戏设定相吻合，因此可以认为游戏的时间背景为1999年。 STAFF企划：久弥直树脚本：久弥直树（月宫亚由、水濑名雪、美坂栞）、麻枝准（川澄舞、泽渡真琴）原画：樋上至CG：みらくる☆みきぽん、鸟の、しのり～音乐：折户伸治、OdiakeS、麻枝准 游戏下载 百度云盘链接：https://pan.baidu.com/s/1hNg-AIIHTgbhkGe3XO6Nuw 提取码：weej","link":"/2020/03/28/Kanon/"},{"title":"Summer pockets","text":"Summer(介绍转自)&nbsp;Pockets(萌娘百科) 原作介绍Key在2016年12月8日发表的最新作，原案是麻枝准 剧本由新岛夕、魁、ハサマ担当，原画则由Na-Ga、和泉つばす、永山ゆうのん、ふむゆん担当。 标题直译为“夏天的口袋”，“就像是装满夏日回忆的小小宝箱（そんな思い出をしまう小さな宝箱のような物でした）”（by 魁） 剧情简介主人公鹰原羽依里为了整理过世祖母的遗物， 利用暑假独自一人来到鸟白岛。 走下一天只有几趟的联络船的时候，他与一名少女相遇。 她任海风吹拂着发丝，只是一直眺望着那条说不出是海是空的界线，渐行渐远…… 恍然回神，那少女已不知走到哪里了。羽依里的心像是被狐狸揪了一下似的，但他依旧向祖母家走去。 那里住了名亲戚——姑妈，她正在整理遗物。 羽依里在帮忙整理祖母的回忆之物时， 虽然对于初次接触的「岛上生活」感到困惑，却也逐渐适应着这样的生活。 都市生活里是没法感受到与大自然的亲密接触的。 这样的岛上生活让他想起了不知从什么时候起便已遗忘的记忆。 与眺望大海（鸣濑白羽）的少女相遇， 与寻找不可思议蝴蝶（空门苍）的少女相遇， 与寻找回忆与海盗船（久岛鸥）的少女相遇， 与住在宁静灯塔（䌷文德斯）中的少女相遇， 在岛上结识了新的伙伴—— 当时的他想，如果这个暑假永远都不结束就好了。 故事舞台 鸟白岛（鳥白（とりしろ） 島（じま））坐落于濑户内海，人口仅仅2000人左右小小孤岛。环顾岛上，信号机一个也没有，便利店也只有一家......这样悠闲的岛屿。况且，截至2000年（本篇故事发生的时间），岛上只有小学和初中，上高中必须要通过联络船前往本土。 鸟白岛本身是架空的岛，不过在开发途中，staff有去濑户内海的岛屿(男木岛、女木岛、直岛)实际取景。作中也会有实景登场。岛上一个鸟黑都没有所以被称为鸟白岛 ，鸟黑全部都被救济吧！ STAFF原案：麻枝准制作人：丘野塔也监督：魁原画：Na-Ga、和泉つばす、永山ゆうのん、ふむゆん、えんぎよし(SD)剧本：新岛夕、魁、ハサマ音乐：折户伸治、麻枝准、どんまる、竹下智博、水月陵 介绍转自萌娘百科 游戏下载 百度网链接：https://pan.baidu.com/s/1sm8BiCxmuJBOWhSj58qpuA 提取码：n2s3","link":"/2020/04/03/Summer-pockets/"},{"title":"Little busters ex","text":"Little(介绍转自)&nbsp;buster(萌娘百科) 游戏简介《Little Busters!》（日语：リトルバスターズ!），是日本Visual Art’s公司旗下的游戏品牌Key社发售的游戏作品。Key开发本作品的消息于2005年年末发表，当初并未定下对象年龄，后来发表是全年龄对象游戏。于2007年6月1日公开试玩版，同年7月27日发售。电击G’smagazine（MediaWorks）2006年3月号开始连载本作的四格漫画，由笹桐ゆうや绘画。 作品介绍于2005年年末发表，当初并未定下对象年龄，后来发表是全年龄对象游戏。于2007年6月1日公开试玩版，同年7月27日发售。电击G’smagazine（MediaWorks）2006年3月号开始连载本作的四格漫画，由笹桐ゆうや绘画。 2008年7月25日发售18禁版本「Little Busters! EX（リトルバスターズ！エクスタシー）」（简称EX版，与此相对应，原版被称为无印版）。将全年龄作品重新推出18禁版，这一举措也是Visual Art‘s有史以来的第一次。EX版中，原游戏中的配角二木佳奈多和笹濑川佐佐美升格为可攻略角色，另外增加一个可攻略新角色朱鹭户沙耶。10月30日，官方网志宣布EX版本销售突破10万套。 2009年12月24日发售PS2版本「Little Busters! Converted Edition（リトルバスターズ！コンバーティッドエディション）」（简称CE版，其后PSP、PSVita均使用此版本），内容与EX版相同，但为全年龄版。 2010年11月25日发售PSP移植版。本次移植版最大的惊喜就是追加了配角的全语音，其声优也堪称豪华，包括杉田智和、中井和哉、石田彰、花泽香菜、游佐浩二、神田朱未、野中蓝、广桥凉、田中敦子、近藤隆等声优都为本作献声。 2012年3月22日移植PSVita。PSVita版让游戏的画面质素大幅提升，分辨率达到了960×544的高度，比PC版还要高。另外对应触摸机能，游戏中出现的棒球练习、配膳和射击等迷你游戏都将可以利用触摸屏来操作，同时也对应按键操作。 2012年11月30日，庆祝本作动画化而推出全年龄向的「Little Busters! Perfect Edition（リトルバスターズ！PERFECT EDITION）」（简称PE版），可以说是只增加了2张CG的CE版。 2013年3月20日，PS3版推出。 2017年11月1日在steam上推出Little Busters! English Edition（相当于去H的EX版）。目前只有日语和英语，分辨率提高至1280x720，且支持触屏操作。国区售价为¥ 103（不打折时）。 2020年4月23日，Nintendo Switch版推出。 剧情概要幼年时，主人公直枝理树因双亲去世而陷入自闭。某日，在时常被痛苦所萦绕的少年面前出现了四个孩子——自称名为“Little Busters”的少年们：枣恭介、枣铃、井之原真人、宫泽谦吾，他们宣布由于世界面临巨大的危机，不得不借助理树的力量来对抗强敌。随即，他们来到了近处的蜜蜂巢穴，与蜜蜂们展开了搏斗，最终弄得浑身被蜇伤，又引起了火灾，召唤来了救火车和无数大人……而后孩子们被校长狠狠地训斥了一顿。但也由此，他们带领着理树走到了外面的世界。虽然理树经常被卷入他们所造成的骚动，却也渐渐忘记了自己的寂寞和伤痛。 “Little Busters”不停的尝试各种新活动，经历了许许多多成败。虽然像傻瓜一样尽做蠢事，但却过得非常快乐。 理树也渴望着“这样的时光能永远延续下去就好了”。 长大后五人一同进了全宿制高中。如今已是二年级生的他们，依然过着快乐而温馨的每一天。某日，三年级的恭介提议组建棒球队。在恭介的提案下，为了凑够人数大家开始寻找队员。 随后，理树和铃在一只名为列侬的猫身上找到一张纸条，上面写着这样的讯息：请找出这个世界的秘密…… STAFF原作：Key监督：山川吉树助监督：樱井亲良系列构成：岛田满角色原案：樋上至、Na-Ga角色设计：饭冢晴子音乐：折户伸治、麻枝准、户越まごめ、PMMK、三轮学、（以下第2期及EX追加）水月陵、岩崎健一郎制作人：川濑浩平动画制作：J.C.STAFF制作：Team Little Busters!（第1期）→Team Little Busters! Refrain（第2期&amp;EX） 游戏下载 百度网盘链接：https://pan.baidu.com/s/1LhtA59Dy5Ffw05B0I4Zscg 提取码：bnw9","link":"/2020/04/10/Little-busters-ex/"}],"tags":[{"name":"galgame","slug":"galgame","link":"/tags/galgame/"}],"categories":[{"name":"key社 galgame","slug":"key社-galgame","link":"/categories/key%E7%A4%BE-galgame/"}]}